Tekla Open API Reference for Tekla Structures 2025
RebarSpacingZone.SpacingType Property
 Gets or sets a value indicating whether the spacing is exact or target. If the spacing is target the spacing algorithm may determine a different spacing to use.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public RebarSpacingZone.SpacingEnum SpacingType { get; set; }
Public Property SpacingType As RebarSpacingZone.SpacingEnum
	Get
	Set
Property Value
Type: RebarSpacingZone.SpacingEnum
See Also
Reference
RebarSpacingZone Class
Tekla.Structures.Model Namespace